---
type: DocumentSaveToCentralProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# DocumentSaveToCentralProgressChangedEventArgs

`Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | FailureDueToConflicts | 2017 Subscription Update | `public bool FailureDueToConflicts { get ; }` |
| Property | RetryTimes | 2017 Subscription Update | `public int RetryTimes { get ; }` |
| Property | SaveToCentralFinished | 2017 Subscription Update | `public bool SaveToCentralFinished { get ; }` |